-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1
-- 生成日期： 2022-04-10 11:02:22
-- 服务器版本： 10.1.38-MariaDB
-- PHP 版本： 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `gdgz`
--

-- --------------------------------------------------------

--
-- 表的结构 `contribution`
--

CREATE TABLE `contribution` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `aspect` varchar(255) NOT NULL COMMENT '方面',
  `title` varchar(255) DEFAULT NULL,
  `content` text,
  `time` datetime NOT NULL,
  `read` enum('0','1') DEFAULT '0' COMMENT '0:站长未读;1:站长已读',
  `release` enum('0','1') DEFAULT '0' COMMENT '发布状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户建议表';

--
-- 转存表中的数据 `contribution`
--

INSERT INTO `contribution` (`id`, `username`, `aspect`, `title`, `content`, `time`, `read`, `release`) VALUES
(1, 'admin', '技术问题', '测试-现已更名“功能介绍”', '<p><br/>这是一个投稿测试项目兼投稿功能介绍。<br/>【功能介绍】 &nbsp;尊敬的用户，投稿栏目可以供您发表对本网站的意见和改进建议，如果您有好的idea，您甚至可以直接在这里攥写并发表有关广州的文章。<br/> &nbsp;当您点击提交后，您的投稿会发送到后台数据库，这时您可点击“我的投稿”查看您的历史投稿动态。您的投稿只有您自己和后台管理员可见，如果后台管理员认为您的投稿有发布价值，将会在审核后（这时对应的消息右边会显示站长已读）第一时间发布您的投稿，这时，您的历史投稿中会有反馈，对应的消息的背景也会变黄。</p>', '2021-06-12 14:36:14', '1', '1'),
(2, 'admin', '技术问题', '文字太小', '</br>文字太小，看起来不直观，不舒服，电脑文盲不会调整文字大小，建议网站建设者将网站中的所有内容直接调整至适合年老眼花者观看.建议网站建设者直接将所有评论区或者投稿区设置为可以自动调整文字大小 ', '0000-00-00 00:00:00', '0', '0'),
(3, 'GD_musicMan', '增加内容', '粤语金曲', '</br>这是站长自己给自己的投稿，我就觉得，这既然是<strong>广州风情</strong>网，他的目的就是<font color=#1FFCF9>学</font><font color=#3EF9F3>习</font><font color=#5DF6ED>做</font><font color=#7CF3E7>网</font><font color=#9BF0E1>站</font><font color=#BAEDDB>的</font><font color=#D9EAD5>技</font><font color=#F8E7CF>术</font>介绍广州的特色，既然如此，广州最有特色的是什么？那必须的是粤语啊，没见广州地铁都有用粤语报站呢吗。但是，我们肯定不能把一堆粤语教程什么的放到这上面，那什么方法能让我们广大的冲浪者接触到粤语呢，那必须得是人类共同的语言--音乐，所以下面就是我收集的粤语金曲，排名不分先后：<br/>  </br>一生何求-陈百强                     1989年    </br>偏偏喜欢你-陈百强                 1983年8月    </br>今宵多珍重-陈百强                 1982年6月    </br>念亲恩-陈百强                        1993-01-01    </br>烟雨凄迷-陈百强                     1988年    </br>喝彩-陈百强   </br>一生不可自决-陈百强   </br>不-陈百强  <br/> </br>真的英雄-卢冠廷&amp;张智霖&amp;成龙&amp;许冠杰&amp;陈慧琳&amp;陈慧娴&amp;李克勤&amp;G.E.M.邓紫棋&amp;张学友&amp;陈奕迅&amp;谭咏麟   </br>爱您不需要理由-李克勤   </br>旧欢如梦 (Live)-李克勤   </br>一生不变-李克勤   </br>月半小夜曲-李克勤   </br>飞花 (粤语)-李克勤   </br>护花使者-李克勤   </br>红日-李克勤  <br/> </br>天才白痴梦-许冠杰   </br>浪子心声-许冠杰   </br>半斤八两-许冠杰   </br>沧海一声笑-许冠杰  <br/> </br>不装饰你的梦-蔡国权  <br/> </br>谁能明白我-林子祥   </br>敢爱敢做-林子祥   </br>长路漫漫任我闯_林子祥   </br>男儿当自强-林子祥  <br/> </br>水中花-谭咏麟   </br>活得潇洒-谭咏麟,陈慧娴   </br>披着羊皮的狼-谭咏麟   </br>一生中最爱-谭咏麟   </br>无言感激-谭咏麟   </br>讲不出再见-谭咏麟   </br>爱在深秋-谭咏麟   </br>朋友-谭咏麟  <br/> </br>情意结-陈慧娴   </br>逝去的诺言-陈慧娴   </br>人生何处不相逢-陈慧娴   </br>千千阙歌-陈慧娴  <br/> </br>难念的经-周华健  <br/> </br>拒绝再玩-张国荣   </br>放荡-张国荣   </br>怪你过分美丽-张国荣   </br>无心睡眠-张国荣   </br>倩女幽魂-张国荣   </br>沉默是金 - 张国荣   </br>风继续吹(Live)-张国荣  <br/> </br>顺流逆流-徐小凤   </br>每一步-徐小凤   </br>重逢-徐小凤   </br>风的季节-徐小凤   </br>人生满希望-徐小凤   </br>风雨同路-徐小凤   </br>花好月圆 (Live)-徐小凤   </br>漫漫前路-徐小凤  <br/> </br>思念-郑少秋&amp;汪明荃   </br>万水千山总是情-汪明荃  <br/> </br>今夜你会不会来-黎明   </br>大海·粤-钟镇涛.lrc   </br>让一切随风 - 钟镇涛  <br/> </br>笑看风云_郑少秋   </br>岁月无情_郑少秋   </br>摘星(摘下满天星·粤)-郑少秋  <br/> </br>灰色轨迹-Beyond   </br>海阔天空Beyond   </br>报答一生-Beyond   </br>不再犹豫-Beyond   </br>光辉岁月-Beyond   </br>真的爱你-Beyond   </br>End ', '2022-06-03 08:44:54', '1', '1');

-- --------------------------------------------------------

--
-- 表的结构 `edit`
--

CREATE TABLE `edit` (
  `id` int(11) NOT NULL,
  `original` varchar(255) NOT NULL COMMENT '原创作者',
  `nickname` varchar(255) DEFAULT NULL,
  `title` varchar(255) NOT NULL COMMENT '文章标题',
  `aspect` varchar(255) DEFAULT NULL COMMENT '文章方面',
  `content` text NOT NULL COMMENT '文章内容',
  `time` datetime NOT NULL COMMENT '发布时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='广府活动表';

--
-- 转存表中的数据 `edit`
--

INSERT INTO `edit` (`id`, `original`, `nickname`, `title`, `aspect`, `content`, `time`) VALUES
(1, 'admin', '（站长）', '功能介绍', '技术问题', '<p>这是一个投稿测试项目兼投稿功能介绍。</p>\r\n<h2>【功能介绍】</h2>\r\n<p>&nbsp; 尊敬的用户，投稿栏目可以供您发表对本网站的意见和改进建议，如果您有好的idea，您甚至可以直接在这里攥写并发表有关广州的文章。\r\n</p>\r\n<p>&nbsp; 当您点击提交后，您的投稿会发送到后台数据库，这时您可点击“我的投稿”查看您的历史投稿动态。您的投稿只有您自己和后台管理员可见，如果后台管理员认为您的投稿有发布价值，将会在审核后（这时对应的消息右边会显示站长已读）第一时间发布您的投稿，这时，您的历史投稿中会有反馈，对应的消息的背景也会变黄。\r\n</p>', '2021-06-13 09:36:14'),
(2, 'GD_musicMan', '（广东音乐人）', '粤语金曲', '增加内容', '<p>　　这是站长自己给自己的投稿，我就觉得，这既然是<strong>广州风情</strong>网，他的目的就是<span style=\"text-decoration: line-through;\">学习做网站的技术</span>介绍广州的特色，既然如此，广州最有特色的是什么？那必须的是粤语啊，没见广州地铁都有用粤语报站呢吗。但是，我们肯定不能把一堆粤语教程什么的放到这上面，那什么方法能让我们广大的冲浪者接触到粤语呢？</br>　　这时我想到了一句话“音乐是人类共同的语言”，这段时间我正好收集了上百首经典老歌，所以下面就是我收集的粤语金曲，排名不分先后：<br/></p><ol class=\" list-paddingleft-2\" style=\"list-style-type: decimal;\"><li><p>一生何求-陈百强&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style=\"color: rgb(51, 51, 51); font-family: \">1989年</span></p></li><li><p>偏偏喜欢你-陈百强&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style=\"color: rgb(51, 51, 51); font-family: \">1983年8月</span></p></li><li><p>今宵多珍重-陈百强&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style=\"color: rgb(51, 51, 51); font-family: \">1982年6月</span></p></li><li><p>念亲恩-陈百强&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style=\"color: rgb(136, 136, 136); font-family: \">1993-01-01</span></p></li><li><p>烟雨凄迷-陈百强&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style=\"color: rgb(51, 51, 51); font-family: \">1988年</span></p></li><li><p>喝彩-陈百强</p></li><li><p>一生不可自决-陈百强</p></li><li><p>不-陈百强</p></li><br/><li><p>真的英雄-卢冠廷&amp;张智霖&amp;成龙&amp;许冠杰&amp;陈慧琳&amp;陈慧娴&amp;李克勤&amp;G.E.M.邓紫棋&amp;张学友&amp;陈奕迅&amp;谭咏麟</p></li><li><p>爱您不需要理由-李克勤</p></li><li><p>旧欢如梦 (Live)-李克勤</p></li><li><p>一生不变-李克勤</p></li><li><p>月半小夜曲-李克勤</p></li><li><p>飞花 (粤语)-李克勤</p></li><li><p>护花使者-李克勤</p></li><li><p>红日-李克勤</p></li><br/><li><p>天才白痴梦-许冠杰</p></li><li><p>浪子心声-许冠杰</p></li><li><p>半斤八两-许冠杰</p></li><li><p>沧海一声笑-许冠杰</p></li><br/><li><p>不装饰你的梦-蔡国权</p></li><br/><li><p>谁能明白我-林子祥</p></li><li><p>敢爱敢做-林子祥</p></li><li><p>长路漫漫任我闯_林子祥</p></li><li><p>男儿当自强-林子祥</p></li><br/><li><p>水中花-谭咏麟</p></li><li><p>活得潇洒-谭咏麟,陈慧娴</p></li><li><p>披着羊皮的狼-谭咏麟</p></li><li><p>一生中最爱-谭咏麟</p></li><li><p>无言感激-谭咏麟</p></li><li><p>讲不出再见-谭咏麟</p></li><li><p>爱在深秋-谭咏麟</p></li><li><p>朋友-谭咏麟</p></li><br/><li><p>情意结-陈慧娴</p></li><li><p>逝去的诺言-陈慧娴</p></li><li><p>人生何处不相逢-陈慧娴</p></li><li><p>千千阙歌-陈慧娴</p></li><br/><li><p>难念的经-周华健</p></li><br/><li><p>拒绝再玩-张国荣</p></li><li><p>放荡-张国荣</p></li><li><p>怪你过分美丽-张国荣</p></li><li><p>无心睡眠-张国荣</p></li><li><p>倩女幽魂-张国荣</p></li><li><p>沉默是金 - 张国荣</p></li><li><p>风继续吹(Live)-张国荣</p></li><br/><li><p>顺流逆流-徐小凤</p></li><li><p>每一步-徐小凤</p></li><li><p>重逢-徐小凤</p></li><li><p>风的季节-徐小凤</p></li><li><p>人生满希望-徐小凤</p></li><li><p>风雨同路-徐小凤</p></li><li><p>花好月圆 (Live)-徐小凤</p></li><li><p>漫漫前路-徐小凤</p></li><br/><li><p>思念-郑少秋&amp;汪明荃</p></li><li><p>万水千山总是情-汪明荃</p></li><br/><li><p>今夜你会不会来-黎明</p></li><li><p>大海·粤-钟镇涛.lrc</p></li><li><p>让一切随风 - 钟镇涛</p></li><br/><li><p>笑看风云_郑少秋</p></li><li><p>岁月无情_郑少秋</p></li><li><p>摘星(摘下满天星·粤)-郑少秋</p></li><br/><li><p>灰色轨迹-Beyond</p></li><li><p>海阔天空Beyond</p></li><li><p>报答一生-Beyond</p></li><li><p>不再犹豫-Beyond</p></li><li><p>光辉岁月-Beyond</p></li><li><p>真的爱你-Beyond<br/></p></li></ol><br>End', '2022-03-06 04:25:58');

-- --------------------------------------------------------

--
-- 表的结构 `ly`
--

CREATE TABLE `ly` (
  `id` int(11) NOT NULL,
  `username` varchar(255) DEFAULT NULL,
  `time` datetime DEFAULT NULL,
  `ly` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='留言簿';

--
-- 转存表中的数据 `ly`
--

INSERT INTO `ly` (`id`, `username`, `time`, `ly`) VALUES
(1, 'user_mum', '2021-05-23 08:08:44', '广府文化的介绍不够全面，广州有很多好吃的好玩的等着你去慢慢发掘，可惜我儿子（此网站建设者）不是一个吃货，少了很多这方面的乐趣'),
(2, 'admin', '2021-05-24 13:47:45', '[回复@user_mum]老妈就不能提多点自己的广州印象吗，一上来就揭我的短...评论区的各位千万不要这样哦(´-ω-`)'),
(5, 'user', '2021-07-14 10:57:43', '如果介绍一个地方和文化，最好是标注一下详细地址。好像坐地铁，几号线，在什么站下车</br>\r\n---------------------------</br>\r\n站长回复：知道了，我会充分重视姑姐的友情评论并且在有时间的时候会做出这方面的改进的！'),
(6, 'user', '2021-07-14 11:05:06', '????'),
(8, 'admin', '2021-07-14 11:09:45', 'good*3'),
(9, 'GD_musicMan', '2022-03-06 05:19:20', '站长化身广东音乐人发表投稿<a href=\"hd.php?id=2\">粤语金曲</a>并获得自己的通过啦，大家快去欣赏一下吧！');

-- --------------------------------------------------------

--
-- 表的结构 `poetry`
--

CREATE TABLE `poetry` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL COMMENT '诗名',
  `dynasty` varchar(255) NOT NULL COMMENT '朝代',
  `poet` varchar(255) NOT NULL COMMENT '诗人/词人',
  `content` text NOT NULL COMMENT '诗句',
  `meter` text COMMENT '格律',
  `translation` text COMMENT '译文',
  `appreciation` text COMMENT '赏析',
  `more` text COMMENT '更多'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='广府诗词表';

--
-- 转存表中的数据 `poetry`
--

INSERT INTO `poetry` (`id`, `title`, `dynasty`, `poet`, `content`, `meter`, `translation`, `appreciation`, `more`) VALUES
(1, '《归雁》', '唐', '杜甫', '闻道今春雁，南归自广州。\r\n见花辞涨海，避雪到罗浮。\r\n是物关兵气，何时免客愁。\r\n年年霜露隔，不过五湖秋。', '【五律】仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。\r\n仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。', '春天来了，我这个远离家乡的人，什么时候才能回家呢？<br>\r\n最让我伤心的是，连那江城的大雁都可以自由自在地向北飞去。', '杜甫作此诗时，正逢战乱，大雁南归广州，一定要经过那些战乱的地方；诗人因战乱无法回乡，便将乡愁寄托于大雁。', NULL),
(2, '《啰唝曲》', '唐', '刘采春', '那年离别日，只道住桐庐。\r\n桐庐人不见，今得广州书。', '【五绝】平平平仄仄，\r\n仄仄仄平平。\r\n仄仄平平仄，\r\n平平仄仄平。', '记得那年你我离别的时候，你说你要去桐庐居住。<br>\r\n去了桐庐后音信全无，如今收到来自广州得书信。', '　据晚唐范摅《云溪友议》记述，刘采春是中唐时的一位女伶，擅长演唐代流行的参军戏。元稹曾有一首《赠刘采春》诗，赞美她“言词雅措风流足，举止低徊秀媚多”，“选词能唱《望夫歌》”。《望夫歌》就是《啰唝曲》。方以智《通雅》卷二十九《乐曲》云：“啰唝犹来罗。”“来罗”有盼望远行人回来之意。据说，“采春一唱是曲，闺妇、行人莫不涟泣”，可见当时此曲歌唱和流行的情况。<br>\r\n这首诗写夫婿逐利而去，行踪无定。五言绝句短小精悍，却把对远在广州的丈夫浓浓的思念寄托诗中。', '<p>&nbsp;</p>\r\n<h3>创作背景</h3>\r\n　　本诗是《啰唝曲六首》中的第四首。《全唐诗》录《啰唝曲六首》，以刘采春为作者，而元稹诗中只说她“能唱”，《云溪友议》则说“采春所唱一百二十首，皆当代才子所作”，接着举引了她所唱的歌词七首，其中六首五言的与《全唐诗》所录相同，另一首七言的却是贞元（唐德宗年号，785—805）年间诗人于鹄的《江南曲》。因此，这《啰唝曲》虽是刘采春所唱，却不一定是她所作。胡应麟《诗薮》指出六首中的“四首，工甚，非晚唐调”，并说：“今系采春，非也。”刘采春究竟是不是此曲的作者，难以确证。<br>\r\n\r\n　　据晚唐范摅《云溪友议》记述，刘采春是中唐时的一位女伶，擅长演唐代流行的参军戏。元稹曾有一首《赠刘采春》诗，赞美她“言词雅措风流足，举止低徊秀媚多”，“选词能唱《望夫歌》”。《望夫歌》就是《啰唝曲》。方以智《通雅》卷二十九《乐曲》云：“啰唝犹来罗。”“来罗”有盼望远行人回来之意。当时，商人妻子的婚姻生活，已成了一个广泛的社会问 题。大批商人长期远行在外做生意，大量的妇女被留守家中，怨妇成群，已经成为一种普遍的现象。而刘采春的歌曲很好的把这些怨妇的心情表现了出来。这就是《啰唝曲》出现的社会基础。'),
(3, '《闰三月二日发船广州来归亭下之官宪台宋》', '宋', '杨万里', '诸人政坐爱闲游，天遣南游天尽头。\r\n到得广州天尽处，方教回首向韶州。', '【七绝】平平仄仄仄平平，\r\n仄仄平平仄仄平。\r\n仄仄平平平仄仄，\r\n平平仄仄仄平平。', NULL, '这是宋代杨万里一首宦游诗，将自己宦游生涯苦中作乐蕴含其中。', NULL),
(4, '《中秋广江驿示韦益》', '唐', '李群玉', '莫惜三更坐，难消万里情。\r\n同看一片月，俱在广州城。\r\n泪逐金波满，魂随夜鹊惊。\r\n支颐乡思断，无语到鸡鸣。', '【五律】仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。\r\n仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。', NULL, '中期佳节，诗人望着那片月，勾起了浓浓的思乡之情。中秋始于唐代，盛行于宋朝，成为仅次于春节的传统节日，本诗便是在中秋夜所作。', NULL),
(5, '《约同人游拾翠洲》', '明', '袁崇焕', '春风十里五羊城，拾翠洲前绿草生。\r\n君若来时须并马，一尊同去听流莺。', '【七绝】平平仄仄仄平平，\r\n仄仄平平仄仄平。\r\n仄仄平平平仄仄，\r\n平平仄仄仄平平。', NULL, '拾翠洲就是现在的沙面岛。当年袁崇焕（生于广东东莞）从这里去北方抗金，是何等的意气风发。袁崇焕回家了，会见亲友，游览山水。诗，回忆这段经历，诗写得很悠闲，也很潇洒。表明这个时候袁崇焕的心情很好，体现了袁崇焕的乡情和亲情。', NULL),
(6, '《岭南江行》', '唐', '柳宗元', '瘴江南去入云烟，望尽黄茆是海边。\r\n山腹雨晴添象迹，潭心日暖长蛟涎。\r\n射工巧伺游人影，飓母偏惊旅客船。\r\n从此忧来非一事，岂容华发待流年。', '【七律】平平仄仄仄平平，\r\n仄仄平平仄仄平。\r\n仄仄平平平仄仄，\r\n平平仄仄仄平平。\r\n平平仄仄平平仄，\r\n仄仄平平仄仄平。\r\n仄仄平平平仄仄，\r\n平平仄仄仄平平。', '<p>译文<br>\r\n江水南去隐入那茫茫云烟，遍地黄茅的尽头便是海边。\r\n雨过天晴山腰间大象出没，阳光灼热潭水里水蛭浮现。\r\n射工阴险地窥伺行人身影，飓母不时地惊扰旅客舟船。\r\n从今后忧虑之事何止一桩，哪容我衰老之身再挨几年！</p>\r\n\r\n<p>注释<br>\r\n岭南：指五岭以南的地区，即今广东、广西一带。\r\n瘴（zhàng）江：古时认为岭南地区多有瘴疠之气，因而称这里的江河为瘴江。云烟：云雾，烟雾。\r\n黄茆（máo）：即黄茅，一年生或多年生草本植物。\r\n山腹：山腰。象迹：大象的踪迹。\r\n潭心：水潭中心。蛟涎：蛟龙的口液。这里指水蛭。\r\n伺：窥伺。射工：即蜮，古代相传有一种能含沙射影的动物。\r\n飓母：飓风来临前天空出现的一种云气，形似虹霓。亦用以指飓风。\r\n华（huā）发：花白的头发。流年：如水般流逝的光阴、年华。</p>', '　　此诗写出了岭南的特异风物瘴江、黄茆、象迹、蛟涎、射工、飓母，曲折地反映出当地荒凉落后的自然环境，同时运用象征手法含蓄地抒发了自己被贬后政治环境的险恶，发出了“ 从此忧来非一事，岂容华发待流年” 的感慨，蕴含着对未来的忧虑之情，表示不能坐待时光的流逝，要在柳州刺史任内为治理地方有所建树。<br>\r\n　　诗中“从此忧来非一事，岂容华发待流年”两句与苏轼的《念奴娇·赤壁怀古》“故国神游，多情应笑我，早生华发”都提到“华发”，但情感有所不同。从两者相比较可知，此诗意志并不消沉，情感并不低回，作者有欲趁暮年有所奋发之意。', '<p>&nbsp;</p>\r\n<h3>创作背景</h3>\r\n此诗作于唐宪宗元和十年（815年）柳宗元进入今广西以后赴任柳州刺史的旅途之中。当时作者因谗被贬柳州，溯湘江进入岭南，继续乘船经灵渠入岭南水系到达柳州刺史任所。'),
(7, '《送王昌龄之岭南》', '唐', '孟浩然', '洞庭去远近，枫叶早惊秋。\r\n岘首羊公爱，长沙贾谊愁。\r\n土毛无缟纻，乡味有槎头。\r\n已抱沈痼疾，更贻魑魅忧。\r\n数年同笔砚，兹夕间衾裯。\r\n意气今何在，相思望斗牛。', '【五律】仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。\r\n仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。', '<p>译文<br>\r\n洞庭衔山远远近近。枫叶如丹先报寒秋。\r\n岘首山赢得羊公爱，长沙城曾使贾谊愁。\r\n岭南风俗衣无丝麻，家乡特产鱼多查头。\r\n我已患重病难以医治，又增添你遭魑魅的担忧。\r\n几年间同笔共舰在一起。今晚起却要各渡长夜天各一份。\r\n情投意合的景况将何在？解相思只有向南望斗牛。</p>\r\n\r\n<p>注释<br>\r\n羊公：晋时镇守襄阳的官吏羊祜。爱：怜爱。\r\n贾谊：汉代著名文学家，善写辞赋。\r\n土毛：土地上生长的五谷杂粮。\r\n缟纻（zhù）：白色生绢及细麻所制的衣服。\r\n槎头：也叫查头鳊，一种味道鲜美的鱼。\r\n沉疴（kē）：久治不愈的病。\r\n贻（yí）：赠予。\r\n魑魅（chīmeì）：指古代传说中生活在山泽中的山神、鬼怪。\r\n同笔砚：指在一起学习或者共事。\r\n兹夕：这晚上。\r\n衾稠（qīnchóu）：衾，被子；稠，夹被。此泛指被褥等。\r\n牛斗：星宿名，指二十八星宿的斗宿和牛宿。</p>', NULL, '　　洞庭去远近，枫叶早惊秋。岘首羊公爱，长沙贾谊愁——洞庭两句：同于前《和卢明府送郑十三还京兼寄之什》之“洞庭一叶惊秋早”。洞庭即洞庭湖。岘首句： 见前《与诸子登岘山》诗注。长沙句：见前《湖中旅泊寄阎防》诗注。四句写山上的红叶让人惊叹秋季的悄然而至，虽然岘山的风景依旧秀美，但即将离别的人早已无心欣赏，友人将远渡渺渺的洞庭再渡浩荡的长沙湘江，迢递征途令人忧伤。<br>\r\n\r\n　　土毛无缟，乡味有查头。已抱沉痼疾，更贻魑魅忧——土毛：土 地上所生长的五谷、草木。《春秋左传正义·昭公七年》：“食土之毛，谁非君臣。”缟：白色的绢和细麻衣服。《春秋左传正义·襄公二十九年》：“（吴季札） 聘于郑，见子产，如旧相识，与之缟带，子产献衣焉。”杜预注：“吴地贵缟，郑地贵，故各献己所贵。”查头：鱼名，产于襄阳。沉痼疾：经久难医之重病。《文 选》卷二十三刘公干《赠五官中郎将四首之一》：“余婴沉痼疾，窜身清漳滨。”魑魅：山精鬼怪。《春秋左传·宣公三年》：“故民入川泽山林，不逢不若，螭魅 罔两。”杜预注：“螭，山神，兽形。魅，怪物。”四句写襄阳地虽粗陋不产缟，但诗人竭尽全力地以襄阳的美味食物来款待友人。此时诗人已身染重病，友人的远去更令他忧心忡忡。<br>\r\n\r\n　　数年同笔砚，兹夕间衾裯。意气今何在，相思望斗牛——间衾裯：衾裯泛指被子，此为别离之意。斗牛：斗、牛二星宿分 野在吴越，此指王昌龄要去的南方地区。庾信《哀江南赋》：“路已分于湘汉，星犹看于斗牛。”四句写二人友谊深厚，情同手足，曾多次诗歌唱和，切磋诗艺，但转眼就要分别了，令人满怀惆怅，空对珍肴美味停箸难食，对金樽清酒也再无往日的兴致，只有眼前同样怅然的离人，还有别后孤独凄凉的思念。<br>\r\n\r\n　　孟浩然与王昌龄同为盛唐优秀的诗人，诗风虽迥然相异，但互为知己，且“数年同笔砚”。诗的前四句既有眼前所见之景，又融合了想象中的征途之景，四句诗出现了三个不同的地名，行人的颠沛流离之苦不言而喻，“爱”和“愁”两字鲜明地刻画出分别时的依依不舍。中间四句如述家常，“无”和“有”点明诗人的倾其所 有来款待远道而来的友人。“已”和“更”是诗人常用的手法，知天命之年，悲愁却接踵而来，层层相压。后四句直接叙说两人的友情，分别之后将是漫长的怀念。 何时才能再相见呢？'),
(8, '《惠州一绝 / 食荔枝》', '宋', '苏轼', '罗浮山下四时春，卢橘杨梅次第新。\r\n日啖荔枝三百颗，不辞长作岭南人。', '【七绝】平平仄仄仄平平，\r\n仄仄平平仄仄平。\r\n仄仄平平平仄仄，\r\n平平仄仄仄平平。（一、二、四句押韵）', '<p>译文<br>\r\n罗浮山下四季都是春天，枇杷和黄梅天天都有新鲜的。\r\n如果每天吃三百颗荔枝，我愿意永远都做岭南的人。</p>\r\n\r\n<p>注释<br>\r\n罗浮山：在广东博罗、增城、龙门三县交界处，长达百余公里，峰峦四百多，风景秀丽，为岭南名山。\r\n卢橘：橘的一种，因其色黑，故名（卢：黑色）。但在东坡诗中指枇杷。《冷斋夜话》 卷一载：“东坡诗：‘客来茶罢无所有，卢橘杨梅尚带酸。’张嘉甫曰：‘卢橘何种果类？ ’答曰：‘枇杷是也。’”\r\n岭南：古代被称为南蛮之地，中原人士闻之生畏，不愿到广东来。此句有三个版本。本诗为“不辞长作岭南人”、《苏东坡全集》：“不妨长作岭南人。”、《锦绣中华历代诗词选》：“总教长作岭南人” </p>', '', NULL),
(9, '《定风波·南海归赠王定国侍人寓娘》', '宋', '苏轼', '常羡人间琢玉郎。天应乞与点酥娘。尽道清歌传皓齿。风起。雪飞炎海变清凉。\r\n万里归来颜愈少。微笑。笑时犹带岭梅香。试问岭南应不好。却道。此心安处是吾乡。', '双调六十二字，前段五句三平韵、两仄韵，后段六句四仄韵、两平韵', '常常羡慕这世间如玉雕琢般丰神俊朗的男子（指王定国），就连上天也怜惜他，赠予他柔美聪慧的佳人（指寓娘）与之相伴。人人称道那女子歌声轻妙，笑容柔美，风起时，那歌声如雪片飞过炎热的夏日使世界变得清凉。\r\n你（指寓娘）从遥远的地方归来却看起来更加年轻了，笑容依旧，笑颜里好像还带着岭南梅花的清香；我问你：“岭南的风土应该不是很好吧？”你却坦然答道：“心安定的地方，便是我的故乡。”', '苏轼的好友王巩（字定国）因为受到使苏轼遭杀身之祸的“乌台诗案”牵连，被贬谪到地处岭南荒僻之地的宾州。王定国受贬时，其歌妓柔奴毅然随行到岭南。公元1083年（元丰六年）王巩北归，出柔奴（别名寓娘）为苏轼劝酒。苏轼问及广南风土，柔奴答以“此心安处，便是吾乡”。苏轼听后，大受感动，作此词以赞。该词刻画了歌女柔奴的姿容和才艺，并着重歌颂了她的美好情操和高洁人品。该词风格柔中带刚，情理交融，空灵清旷，细腻柔婉。', '【高中必备】'),
(10, '《题蒲涧寺》', '宋', '苏轼', '不用山僧导我前，自寻云外出山泉。\r\n千章古木临无地，百尺飞涛泻漏天。\r\n昔日菖蒲方士宅，后来薝卜祖师禅。\r\n而今只有花含笑，笑道秦皇欲学仙。', '仄仄平平仄仄平，仄平平仄仄平平。\r\n平平仄仄平平仄，仄仄平平仄仄平。\r\n仄仄平平平仄仄，仄平仄仄仄平平。\r\n平平仄仄平平仄，仄仄平平仄仄平。', '①章:大树。②泻漏天:意说山泉飞泻似从天而降。蜀地多雨,俗称“漏天”。此处借用。③菖蒲方士:指安期生。蒲涧多生菖蒲,称九节菖蒲,相传秦方士安期生采服仙去。④薝(zhan)蔔(pu):花名,梵语,义译为郁金花。唐卢伦《送静居法师》诗: “薝蔔名花飘不断,醍醐法味洒何浓。”祖师禅:佛教禅宗主张以心传心,祖辈相传,不立文字,谓之“祖师禅”,与《楞伽经》之“如来禅”相对而言。以如来禅为教内未了之禅,以祖师禅为教外别传至极之禅。⑤作者自注:“寺中多含笑花。”欧阳修《归田录》云丁晋公(丁谓)有“草解忘忧忧底事,花名含笑笑何人”句。⑥秦皇:秦始皇。', '北宋绍圣元年(1094),因新旧党争,苏轼由知定州被诏责英州,旋贬宁远军节度副使、惠州安置不得签署公事,遂携妾朝云及子苏过赴贬所,九月过广州,此诗即作于其时。此诗描写了蒲涧寺及其周围的风物和传说,还讽刺了秦始皇求仙的愚蠢,表现作者在逆境中仍能保持一种乐天知命、坦然自处的态度。作者在广州同时作诗多首,其离开广州时作《以广州》诗曰:“朝市日已远,此身良自知。三杯软饱后,一枕黑甜余。蒲涧疏钟外,黄湾落木初。天涯未觉远,处处名渔樵。”也可见作者的这种态度。此诗原有注:“地产菖蒲十二节,相传安期生故居,始皇访之于此。”', '<p>&nbsp;</p><p>&nbsp;</p>\r\n<h3>参考消息</h3>\r\n<strong>广州地图之——苏东坡的羊城诗书足迹</strong><br>\r\n　　话说咱们广东，改革开放最前沿，富裕繁华，吸引无数怀揣梦想的内陆人南下打拼发财。然而，1000年前的北宋时期可不是这样，南粤之地遥远偏僻，酷热难当，瘟疫盛行，中原人要来广东的感觉，就像现代中国人要去非洲一样。</br>\r\n　　苏东坡能到广东来，还要拜当时的明星改革家王安石所赐。王安石搞一次轰轰烈烈大变法，苏东坡指摘其中很多弊病，于是就被贬官发落咯。王安石对苏东坡还算不狠，即使苏东坡犯了很严重的“乌台诗案”，入狱三个月后，也只是让他去湖北黄州当个团练副使（相当现在的市武装部副部长，苏在案发前是大城市徐州的太守）。王安石变法失败后，司马光当政，开始对王安石那派新党打击报复，贬官的贬官，入狱的入狱，苏东坡则复职，在中原与江南各大中城市当太守。<br>\r\n　　风水轮转得太快，才8年后，新党再次上台，报复更为猛烈，苏东坡作为旧党（其实他也不太赞同旧党）难逃厄运，被一贬贬到广东惠州任节度副使（市级军分区副司令）。3年后更是再贬到海南儋州当个什么军中别驾，甚至不能住官舍吃官粮。宋朝官场有点意思，贬官总是把人贬去军中当武职，实际就是让文人去军营受苦当惩罚，从这方面也可看出宋朝武将地位之低，军人待遇之差。</br>\r\n<p><strong>苏东坡初游广州</strong></p>\r\n       苏东坡并没有在广州谪居过，不过广州作为广南东路的首府和地理中心，来来去去都免不了要经过。公元1094年，年已58岁的苏东坡从北方来惠州，应是从梅关古驿道进广东，坐船顺着北江经韶关到广州，之后再从广州坐船沿着东江去惠州。</br>\r\n<p><img src=\"http://image109.360doc.com/DownloadImg/2018/06/1914/136207815_5_20180619023417738\" alt=\"\" data-type=\"jpeg\" data-copyright=\"0\" data-ratio=\"0.7795527156549521\" data-s=\"300,640\" data-w=\"626\"></p>\r\n          <p> </p>\r\n          <p><img src=\"http://image109.360doc.com/DownloadImg/2018/06/1914/136207815_6_20180619023417847\" alt=\"\" data-type=\"jpeg\" data-copyright=\"0\" data-ratio=\"0.5711183496199783\" data-s=\"300,640\" data-w=\"921\"></p>\r\n<p><strong>【蒲涧寺】</strong></p>\r\n　　苏东坡一家这次在广州住了好些天，住在哪里无从考证，一个地方他肯定去过，即白云山蒲谷溪涧（进南门不远的登山路右手边），那时候没有能仁寺，倒有个蒲涧寺，老苏游兴很高，得诗两首：<strong>《题蒲涧寺》</strong>《赠蒲涧长老》<br>\r\n　　他和蒲涧的缘分并没在写两首诗后就缘尽。苏东坡到惠州后，广州城发生瘟疫，苏东坡当过多地太守治政经验很丰富，就写信给广州太守，提议用五管并排大竹筒，把蒲涧的泉水导引到广州城里，再分流到各居民区的小石槽里。广州百姓因此提前1000年享用上自来水，做成此项工程的王太守人们都不记得了，只记得出主意的苏东坡，谁叫他是大文豪呢。<br>\r\n----------------<br>\r\n=>更多苏东坡的“广州印象”见<a href=\"http://www.360doc.com/content/18/0619/14/1249927_763549804.shtml\" target=\"_block\" title=\"广州地图之——苏东坡的羊城诗书足迹【原文】\">http://www.360doc.com/content/18/0619/14/1249927_763549804.shtml</a>'),
(11, '《赠蒲涧长老》', '宋', '苏轼', '优钵昙花岂有花，问师此曲唱谁家？\r\n已从子美得桃竹，不向安期觅枣瓜。\r\n燕坐林间时有虎，高眠竹后不闻鸦。\r\n圣游自古兼支许，为采松舫寄一车。', '【五律】仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。\r\n仄仄平平仄，\r\n平平仄仄平。\r\n平平平仄仄，\r\n仄仄仄平平。', '【优钵昙】。即优昙钵。《南史·夷貊传下·波斯国》：“国中有优鉢曇花，鲜华可爱。”宋罗大经《鹤林玉露》卷三：“豫章之诗，……贯穿驰骋，工夫精到，虽未极古之源委，而其植立不凡，斯亦宇宙之奇诡也。开闢以来，能自表现於世若此者，如优鉢曇华时一现耳。”2.指优钵昙花。清朱锡绶《幽梦续影》：“唐人之诗，多类名花：长吉似优鉢曇，彩云拥护；飞卿似曼陀罗，璚月玲瓏。”参阅清吴其浚《植物名实图考》卷三六。', NULL, '<p>&nbsp;</p><p>&nbsp;</p>\r\n<h3>参考消息</h3>\r\n<strong>广州地图之——苏东坡的羊城诗书足迹</strong><br>\r\n　　话说咱们广东，改革开放最前沿，富裕繁华，吸引无数怀揣梦想的内陆人南下打拼发财。然而，1000年前的北宋时期可不是这样，南粤之地遥远偏僻，酷热难当，瘟疫盛行，中原人要来广东的感觉，就像现代中国人要去非洲一样。</br>\r\n　　苏东坡能到广东来，还要拜当时的明星改革家王安石所赐。王安石搞一次轰轰烈烈大变法，苏东坡指摘其中很多弊病，于是就被贬官发落咯。王安石对苏东坡还算不狠，即使苏东坡犯了很严重的“乌台诗案”，入狱三个月后，也只是让他去湖北黄州当个团练副使（相当现在的市武装部副部长，苏在案发前是大城市徐州的太守）。王安石变法失败后，司马光当政，开始对王安石那派新党打击报复，贬官的贬官，入狱的入狱，苏东坡则复职，在中原与江南各大中城市当太守。<br>\r\n　　风水轮转得太快，才8年后，新党再次上台，报复更为猛烈，苏东坡作为旧党（其实他也不太赞同旧党）难逃厄运，被一贬贬到广东惠州任节度副使（市级军分区副司令）。3年后更是再贬到海南儋州当个什么军中别驾，甚至不能住官舍吃官粮。宋朝官场有点意思，贬官总是把人贬去军中当武职，实际就是让文人去军营受苦当惩罚，从这方面也可看出宋朝武将地位之低，军人待遇之差。</br>\r\n<p><strong>苏东坡初游广州</strong></p>\r\n       苏东坡并没有在广州谪居过，不过广州作为广南东路的首府和地理中心，来来去去都免不了要经过。公元1094年，年已58岁的苏东坡从北方来惠州，应是从梅关古驿道进广东，坐船顺着北江经韶关到广州，之后再从广州坐船沿着东江去惠州。</br>\r\n<p><img src=\"http://image109.360doc.com/DownloadImg/2018/06/1914/136207815_5_20180619023417738\" alt=\"\" data-type=\"jpeg\" data-copyright=\"0\" data-ratio=\"0.7795527156549521\" data-s=\"300,640\" data-w=\"626\"></p>\r\n          <p> </p>\r\n          <p><img src=\"http://image109.360doc.com/DownloadImg/2018/06/1914/136207815_6_20180619023417847\" alt=\"\" data-type=\"jpeg\" data-copyright=\"0\" data-ratio=\"0.5711183496199783\" data-s=\"300,640\" data-w=\"921\"></p>\r\n<p><strong>【蒲涧寺】</strong></p>\r\n　　苏东坡一家这次在广州住了好些天，住在哪里无从考证，一个地方他肯定去过，即白云山蒲谷溪涧（进南门不远的登山路右手边），那时候没有能仁寺，倒有个蒲涧寺，老苏游兴很高，得诗两首：《题蒲涧寺》<strong>《赠蒲涧长老》</strong><br>\r\n　　他和蒲涧的缘分并没在写两首诗后就缘尽。苏东坡到惠州后，广州城发生瘟疫，苏东坡当过多地太守治政经验很丰富，就写信给广州太守，提议用五管并排大竹筒，把蒲涧的泉水导引到广州城里，再分流到各居民区的小石槽里。广州百姓因此提前1000年享用上自来水，做成此项工程的王太守人们都不记得了，只记得出主意的苏东坡，谁叫他是大文豪呢。<br>\r\n----------------<br>\r\n=>更多苏东坡的“广州印象”见<a href=\"http://www.360doc.com/content/18/0619/14/1249927_763549804.shtml\" target=\"_block\" title=\"广州地图之——苏东坡的羊城诗书足迹【原文】\">http://www.360doc.com/content/18/0619/14/1249927_763549804.shtml</a>');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(10) NOT NULL COMMENT '用户标识符',
  `username` varchar(20) NOT NULL COMMENT '账号',
  `nickname` varchar(20) NOT NULL COMMENT '昵称',
  `gender` enum('男','女','保密') DEFAULT '保密' COMMENT '性别',
  `password` varchar(20) NOT NULL COMMENT '密码',
  `education` varchar(5) DEFAULT NULL COMMENT '学历',
  `city` varchar(2) DEFAULT NULL COMMENT '所在城市',
  `hobby` varchar(5) DEFAULT NULL COMMENT '浏览偏好',
  `question` varchar(30) DEFAULT NULL COMMENT '安全问题',
  `answer` varchar(30) DEFAULT NULL COMMENT '问题答案',
  `phone` varchar(14) DEFAULT NULL COMMENT '手机号',
  `email` varchar(20) DEFAULT NULL COMMENT '电子邮箱',
  `self-introduction` text COMMENT '自我介绍',
  `user_group` enum('会员','管理员') NOT NULL DEFAULT '会员' COMMENT '用户组',
  `regtime` datetime NOT NULL COMMENT '注册时间',
  `style` varchar(5) NOT NULL COMMENT '注册方式'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='网站（注册）用户表';

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `nickname`, `gender`, `password`, `education`, `city`, `hobby`, `question`, `answer`, `phone`, `email`, `self-introduction`, `user_group`, `regtime`, `style`) VALUES
(1, 'admin', '站长', '男', 'admin123', '中职/高中', '--', '1;2', '我的班主任是谁？', '黄老师', '--', 'gdgz@qq.com', '本网站的设计者兼全权管理员，爱好为写bug©保留所有权利', '管理员', '2020-03-18 09:39:00', '管理员注册'),
(2, 'XG3306', '隧光', '男', '123456', NULL, NULL, NULL, '我的班主任是谁？', '黄老师', NULL, '164@qq.com', NULL, '会员', '2020-03-18 09:40:00', '后台注册'),
(3, 'user', '', '男', '1234', NULL, NULL, NULL, '对此网站的评价？', '真好', NULL, '123@qq.com', NULL, '会员', '2021-04-14 00:00:00', '后台注册'),
(4, 'GD_musicMan', '广东音乐人（站长小号）', '保密', 'demo$4321', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '会员', '2022-03-06 07:58:36', '后台注册');

--
-- 转储表的索引
--

--
-- 表的索引 `contribution`
--
ALTER TABLE `contribution`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `edit`
--
ALTER TABLE `edit`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `ly`
--
ALTER TABLE `ly`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `poetry`
--
ALTER TABLE `poetry`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`,`username`) USING BTREE;

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `contribution`
--
ALTER TABLE `contribution`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `edit`
--
ALTER TABLE `edit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `ly`
--
ALTER TABLE `ly`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `poetry`
--
ALTER TABLE `poetry`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '用户标识符', AUTO_INCREMENT=5;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
